{"pageProps":{"implementationsPageData":{"id":"csharp","contentHtml":"<h1>SSZ in C#</h1>\n<h2>From <strong>Cortex Simple Serialize</strong></h2>\n<p>An implementation of the ETH2.0 Simple Serialize (SSZ) specification, for .NET Core (written in C#).</p>\n<p>For details of the specification, see <a href=\"https://github.com/ethereum/eth2.0-specs/blob/dev/specs/simple-serialize.md\">https://github.com/ethereum/eth2.0-specs/blob/dev/specs/simple-serialize.md</a></p>\n<p>Supports serialization and Merkleization for uint8 (byte), uint16 (ushort), uint32 (uint), uint64 (ulong), boolean, containers, vectors, lits, bitvector, and bitlist.</p>\n<p>Functionality is via SSZ element wrappers, that can be easily created from values and objects. See the tests for examples. There is no automatic (reflection-based) serialization, or built-in support for streams yet (serialization just returns a byte span).</p>\n<p>Does not yet support uint128, uint256, or union types. Does not yet support deserialization.</p>\n<p>Does not support self-signed containers directly, although you can readily get the hash root of the truncated values, i.e. the signing root.</p>\n<h2>Getting started</h2>\n<h3>Pre-requisites</h3>\n<ul>\n<li>.NET Core 3.0 development tools</li>\n</ul>\n<h3>Compile and run tests</h3>\n<p>To compile and run the unit tests:</p>\n<pre><code>dotnet test test/Cortex.SimpleSerialize.Tests --verbosity normal\n</code></pre>\n<h3>Optional requirements</h3>\n<ul>\n<li>PowerShell Core, to run build scripts</li>\n<li>An editor, e.g. VS Code, if you want to contribute</li>\n</ul>\n<h3>Compile, test and package</h3>\n<p>To run tests and then build a release package, with a gitversion based version number:</p>\n<pre><code>./build.ps1\n</code></pre>\n<p>The NuGet package will be created at:</p>\n<pre><code>src\\Cortex.SimpleSerialize\\bin\\Release\\Cortex.SimpleSerialize.&#x3C;ver>.nupkg'.\n</code></pre>\n<h2>Development</h2>\n<p>Pull requests welcome, but will need to align with the project direction to be accepted.</p>\n<h2>Contributions</h2>\n<p>Donations (ETH) can be sent to 0x1a474C09EE765C17fbf35B8B0fcb28a2B0E6e6db</p>\n<h2>License</h2>\n<p>Copyright (C) 2019 Gryphon Technology Pty Ltd</p>\n<p>This library is free software: you can redistribute it and/or modify it under the terms of the GNU Lesser General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.</p>\n<p>This library is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License and GNU General Public License for more details.</p>\n<p>You should have received a copy of the GNU Lesser General Public License and GNU General Public License along with this library. If not, see <a href=\"https://www.gnu.org/licenses/\">https://www.gnu.org/licenses/</a>.</p>\n","title":"c# ssz","toc":[]}},"__N_SSG":true}